In [4]:
import numpy as np
import pandas as pd

In [8]:
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')
# 1714 * 4

In [10]:
returns = price.pct_change() # 전날 대비 변한 비율(%)
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [11]:
# MSFT, IBM 주식 가격 간 피어슨 상관게수
returns['MSFT'].corr(returns['IBM'])

0.4997636114415114

In [12]:
returns['MSFT'].cov(returns['IBM'])

8.870655479703546e-05

In [13]:
returns.MSFT.corr(returns.IBM)

0.4997636114415114

In [14]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [15]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [16]:
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [17]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [18]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [19]:
obj.value_counts() # 특정 값 몇 번씩 나왔는지!

c    3
a    3
b    2
d    1
dtype: int64

In [22]:
pd.value_counts(obj, sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [24]:
mask = obj.isin(['b', 'c']) # 각 행의 값이 b, c중에 있나? 있으면 True
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [26]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [28]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [29]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [32]:
string_data[0] = None

In [33]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [34]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [35]:
# null 값 처리 가즈아`~
from numpy import nan as NA

In [36]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [37]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [38]:
data[data.notnull()] # null이 아닌 것만 가지고 옴!

0    1.0
2    3.5
4    7.0
dtype: float64

In [39]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [41]:
# Dataframe 에서 na 값 처리방법!

data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [42]:
data.dropna() 
# 장점 : 간단함
# 단점 : 행 원소들 중 na가 1개라도 있으면 행 전체가 사라져버림

     0    1    2
0  1.0  6.5  3.0

In [43]:
data.dropna(how='all')
# 행 전체가 na인 행만 제거!

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [44]:
data[4] = NA

In [45]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [48]:
# 열 방향으로 NA값 제거
data.dropna(axis=1, how ="all") # 모두 na 값인 컬럼만 삭제요

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [49]:
df = pd.DataFrame(np.random.randn(7,3))

In [50]:
df

          0         1         2
0  0.851832  0.753124  0.429547
1 -0.015246  1.549967  1.493582
2 -0.854821 -0.352175 -0.492965
3  1.377926 -0.301994 -0.538150
4  2.465016 -0.168898  1.881870
5  0.873390 -0.404913  0.642918
6 -0.089124  0.522101  0.623006

In [52]:
# 결측치 생성!
df.iloc[:4, 1] = NA
df

          0         1         2
0  0.851832       NaN  0.429547
1 -0.015246       NaN  1.493582
2 -0.854821       NaN -0.492965
3  1.377926       NaN -0.538150
4  2.465016 -0.168898  1.881870
5  0.873390 -0.404913  0.642918
6 -0.089124  0.522101  0.623006

In [54]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.851832       NaN       NaN
1 -0.015246       NaN       NaN
2 -0.854821       NaN -0.492965
3  1.377926       NaN -0.538150
4  2.465016 -0.168898  1.881870
5  0.873390 -0.404913  0.642918
6 -0.089124  0.522101  0.623006

In [57]:
df.dropna(thresh=3)

          0         1         2
4  2.465016 -0.168898  1.881870
5  0.873390 -0.404913  0.642918
6 -0.089124  0.522101  0.623006

In [60]:
df.fillna(0) # 결측치를 0으로 채워버림!

          0         1         2
0  0.851832  0.000000  0.000000
1 -0.015246  0.000000  0.000000
2 -0.854821  0.000000 -0.492965
3  1.377926  0.000000 -0.538150
4  2.465016 -0.168898  1.881870
5  0.873390 -0.404913  0.642918
6 -0.089124  0.522101  0.623006

In [62]:
df.fillna({1:0.5, 2:-1}) # column 1 na : 0.5, column 2 na : -1 로 채움!

          0         1         2
0  0.851832  0.500000 -1.000000
1 -0.015246  0.500000 -1.000000
2 -0.854821  0.500000 -0.492965
3  1.377926  0.500000 -0.538150
4  2.465016 -0.168898  1.881870
5  0.873390 -0.404913  0.642918
6 -0.089124  0.522101  0.623006

In [64]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0  0.955257  0.749203 -0.113334
1  1.134398 -1.271128  1.693451
2  0.898287  0.940004 -1.340891
3 -0.421809  0.002370 -0.226444
4 -0.416364  1.336124 -0.563138
5 -0.245664  0.662203  0.774481

In [65]:
df.iloc[2:, 1] = NA
df

          0         1         2
0  0.955257  0.749203 -0.113334
1  1.134398 -1.271128  1.693451
2  0.898287       NaN -1.340891
3 -0.421809       NaN -0.226444
4 -0.416364       NaN -0.563138
5 -0.245664       NaN  0.774481

In [66]:
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.955257  0.749203 -0.113334
1  1.134398 -1.271128  1.693451
2  0.898287       NaN -1.340891
3 -0.421809       NaN -0.226444
4 -0.416364       NaN       NaN
5 -0.245664       NaN       NaN

In [67]:
df.fillna(method="ffill") # NaN 바로 위의 값들로 다 채워짐
# 문제점 : 첫번째가 NaN이면 다 NaN이 되버림!

          0         1         2
0  0.955257  0.749203 -0.113334
1  1.134398 -1.271128  1.693451
2  0.898287 -1.271128 -1.340891
3 -0.421809 -1.271128 -0.226444
4 -0.416364 -1.271128 -0.226444
5 -0.245664 -1.271128 -0.226444

In [68]:
data = pd.Series([1., NA, 3.5, NA, 7]) 
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [69]:
data.fillna(data.mean()) # 평균으로 채우자!

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64